# a = [273, 103, 5, 32, 65, 9, 72, 800, 99]

# for i in a :
#     if i > 99 :
#         print(i)

# a = [273, 103, 5, 32, 65, 9, 72, 800, 99]

# for i in a :
#     if i % 2 == 0 :
#         print(f"{i}는 짝수입니다")
#     else :
#         print(f"{i}는 홀수입니다.")

# a = [273, 103, 5, 32, 65, 9, 72, 800, 99]
# b = ["짝수","홀수"]

# for i in a :
#     print(f"{i}는 {b[i % 2]}입니다.")

# a = [273, 103, 5, 32, 65, 9, 72, 800, 99]

# for i in a :
#     j = str(i)
#     print(f"{i}는 {len(j)} 자릿수입니다.")

# a = [
#     [1,2,3,],
#     [4,5,6,7],
#     [8,9]
# ]
# print(a)
# for i in a :
#     for j in i :
#         print(j)

# [[1,4,7], [2,5,8], [3,6,9]]
a = [1,2,3,4,5,6,7,8,9]
b = [[], [], []]

for i in a :
    b[(i - 1) % 3].append(i) # b 연산후 리스트 선택(0~2) 후 i 순차대입
print(b)